[
    {
        "title": "Start"
    },
    {
        "body": "[Resonance]: Shivers are sent down your spine, as you feel the presence of something ancient and powerful. The air is thick with the scent of decay and the sound of whispers fills your ears. You feel a pull towards the darkness, as if something is calling you to it. You can't help but feel a sense of dread, as you realize that you are not alone in this cryptic place. \n\n[1]: [Proceed] \n[2]: [Stand still] \n[3]: \"This is pointless, isn't it?\"",
        "key": {
            "1": "Next",
            "2": "Next",
            "3": "Next"
            },
        "title": "Start1"
    },
    {
        "body": "[Resonance]: You take a step forward, resistance is pointless, and the whispers grow louder. The darkness seems to envelop you, and you feel as if you are being watched. \n\n[1]: [Accept your fate] \n[2]: [Close your eyes]",
        "key": {
            "1": "Fate",
            "2": "EyesClosed"
        },
        "title": "Next"
    },
    {
        "body": "[Clairvoyance]: You close your eyes, for exactly four seconds, and when you open them, you find yourself in a different place. The darkness is gone, and you are standing in a room filled with light. You feel a sense of peace and tranquility, as if you have finally found what you were looking for. \n\n[1]: [Embrace the light] \n[2]: [Wake up]",
        "key": {
            "1": "Embrace",
            "2": "WakeUp"
        }, 
        "title": "EyesClosed"
    },
    {
        "body": "[Forbearance]: \"Do yourself a favor and stop. We both know this place is not real. It's time to face the consequences and wake up. You've done well, I believe in you. We can do it.\" \n\n[1]: [Wake up]",
        "key": {
            "1": "WakeUp"
        },
        "title": "Embrace"
    },
    {
        "body": "[Eloquence]: You open your eyes again, and the darkness is still there. This is for real now. \n\n[Forbearance]: There is no end. \n\n[Clairvoyance]: The time to face the consequences arrive. \n\n [Resonance]: \"We can do this.\"\n\n[1]: [Face the consequences]",
        "key": {
            "1": "Fate"
        },
        "title": "WakeUp"
    },
    {
        "body": "[Matilda]: \"In last night's dream, it appeared. A shining, glistening sign. I touched it. Will you?\" A voice echoes in your mind. It is not human. Your body reacts accordingly: you are terrified by the beast before your eyes. \n\n[1]: \"Who are you?\" \n[2]: [Ignore the voice]",
        "key": {
            "1": "Who",
            "2": "Ignore"
        },
        "title": "Fate"
    },
    {
        "body": "[Matilda]: \"You need not to speak if you wish. We are one.\" The voice echoes in your mind once again. *It* knows you're trying to ignore it; almost as if it's inside your mind. \n\n[1]: \"Who are you?\"",
        "key": {
            "1": "Who"
        },
        "title": "Ignore"
    },
    {
        "body": "[Matilda]: \"You know who I am. We have met before. Just outside the pilgrim's door. Honestly, we both knew you had insufficient schemes.\" \n\n[1]: \"Are you the one who stole my memories?\" \n[2]: \"What do you want from me?\" \n[3]: \"What do you mean by 'insufficient schemes'?\"",
        "key": {
            "1": "Memories",
            "2": "WhatWant",
            "3": "Schemes"
        },
        "title": "Who"
    },
    {
        "body": "[Matilda]: \"You have been chosen. You have been marked. You have been blessed. You have been cursed. You have been given a gift. You have been given a burden. You have been given a chance. Yet you threw it away at the funeral march.\" \n\n[1]: \"Funeral march?\" \n[2]: \"What curse?\" \n[3]: \"What burden?\" \n[4]: \"What chance?\"",
        "key": {
            "1": "FuneralMarch",
            "2": "Curse",
            "3": "Burden",
            "4": "Chance"
        },
        "title": "Schemes"
    },
    {
        "title": "FuneralMarch"
    },
    {
        "title": "Curse"
    },
    {
        "title": "Burden"
    },
    {
        "title": "Chance"
    },
    {
        "body": "[Matilda]: \"Want? I want nothing from you anymore.\" The cockroach-like eldritch beast speaks arrogantly. \"You have served your purpose. You have become what you were meant to be.\" \n\n[1]: \"Did you take my memories from me?\" \n[2]: \"What purpose?\"",
        "key": {
            "1": "Memories",
            "2": "Purpose"
        },
        "title": "WhatWant"
    },
    {
        "title": "Purpose"
    },
    {
        "title": "Memories"
    },
    {
        "body": "",
        "title": "End"
    }
]