[
    {
        "body": "[Camellia, The Uneasy Student]: \"Hey!\" \n\n [Resonance]: You can tell she's bothered by something, not you, but something... Better not to mention it. \n\n[1]: \"Hey\" \n[2]: \"Do you know who I am?\"",
        "key": {
            "1": "Hey",
            "2": "KnowMe"
        },
        "title": "Start"
    },
    {
        "body":"[Camellia, The Uneasy Student]: \"So how's exam week going for you? Were you able to finish that final Programming Languages project you were talking about?\" \n\n[1]: \"Wait, you know who I am?\" \n[2]: \"Exam week?\"",
        "key": {
            "1": "KnowMe",
            "2": "ExamWeek"
        },
        "title": "Hey"
    },
    {
        "body": "[Camellia, The Uneasy Student]: \"Yes? Do you not know we're in the middle of exam week?\" \n\n[1]: \"I'm sorry, but I don't know what's going on. I think I lost my memory. Do you know anything about that?\" \n[2]: \"Which exams do I have?\" \n[3]: \"Do you know me?\"",
        "key": {
            "1": "Memory",
            "2": "Exams",
            "3": "KnowMe"
        },
        "title": "ExamWeek"
    },
    {
        "body": "[Camellia, The Uneasy Student]: \"We're classmates, but I'm not good with names. I'm sorry.\" \n\n[1]: \"I think I lost my memory. Did you hear anything weird coming from Room 101 last night?\" \n[2]: \"I don't remember you either.\" \n[3]: \"You mentioned exams. What exams do I have?\"",
        "key": {
            "1": "Memory",
            "2": "RememberYou",
            "3": "Exams"
        },
        "title": "KnowMe"
    },
    {
        "body": "[Camellia, The Uneasy Student]: \"That's okay! Our class is quite big.\"\n\n[Resonance] \"She doesn't care you don't know her. She's just trying to be polite.\" \n\n[1]: \"I'm pretty sure I lost my memory. Did you hear anything weird coming from Room 101 last night?\" \n[3]: \"Exams! You mentioned some. What exams do I have?\"",
        "key": {
            "1": "Memory",
            "2": "Exams"
        },
        "title": "RememberYou"
    },
    {
        "body": "[Camellia, The Uneasy Student]: \"Well, we've got Multivariable Calculus, Linear Algebra, and Discrete Mathematics exams; I'm quite worried about those to be honest. Then four projects, including a Programming Languages project due tomorrow, but I think you already finished that. I'm also quite sure you're taking an elective class.\" \n\n [1]: \"You made up those words.\"\n[2]: \"I think I lost my memory. Did you hear anything weird coming from Room 101 last night?\"",
        "key": {
            "1": "Wow",
            "2": "Memory"
        },
        "title": "Exams"
    },
    {
        "body": "[Camellia, The Uneasy Student]: \"I wish I did, but unfortunatelly these are all words that exist...\" \n\n[1]:\"By the way, did you head anything weird coming from my room yesterday? I'm still quite worried about this whole amnesia thing.\"",
        "key": {
            "1": "Memory"
        },
        "title": "Wow"
    },
    {
        "body": "[Camellia, The Uneasy Student]: \"Now that you mention, while I was finishing my Programming Languages project, I heard some strange sounds coming from the direction of your room.\" \n\n[1]: \"What kind of sounds?\" \n[2]: \"Do you know what it was?\"",
        "key": {
            "1": "Sounds",
            "2": "Sounds"
        },
        "title": "Memory"
    },
    {
        "body": "[Camellia, the Uneasy Student]: \"You know crickets? It was like that, but deeper and more imposing. Didn't look human to me. I thought I was halucinating from stress at first, but now I'm not sure.\" \n\n[1]: \"Crickets? What are those?\" \n[2]: \"I see... Do you know anything else?\"",
        "key": {
            "1": "Crickets",
            "2": "AnythingElse"
        },
        "title": "Sounds"
    },
    {
        "body": "[Camellia, The Uneasy Student]: \"Crickets are insects that make a chirping sound. They're quite common in the countryside, but I've never heard them in the city.\" \n\n[1]: \"I see... Do you know anything else? Did you see me or anything?\"",
        "key": {
            "1": "AnythingElse"
        },
        "title": "Crickets"
    },
    {
        "body": "[Camellia, The Uneasy Student]: \"I'm sorry, that's all I know. I was too focused on my project.\"\n\n[1]: \"I see... Thanks for the help. Hopefully I'll find out what's going on.\"",
        "key": {
            "1": "End"
        },
        "title": "AnythingElse"
    },
    {
        "title": "End"
    }
]